{
  "title": "Home",
  "articlesNavigation": "Articles",
  "misc": "Misc",
  "articles": {
    "whatWhy": {
      "title": "What and Why?",
      "paragraphs": [
        "The purpose of this site is to present what I like to do. It was created out of the necessity of displaying my work and my aptitudes, since they fall out of what my academic formation demonstrates.",
        "Everything was made (or is going to be made), following these principles: accessibility, design, performance. The source code of this site is open source and it's freely available on Github under the MIT license. You can get it through my [GitHub profile](https://github.com/danieluy/danielsosauy)."
      ],
      "banner": {
        "src": "assets/img/article-banners/undraw_design_notes_8dmv.svg",
        "alt": "what and why? decorative ilustration"
      }
    },
    "accessibility": {
      "title": "Accessibility",
      "paragraphs": [
        "This is a topic that I recently started to get passionate about. Though thinking about accessibility is not new for me, I was very busy learning many other things in this new world of computer science, and quite honestly I was procrastinating my way into web accessibility. So when I decided to remake my website, the first decision I made was: accessibility must not suffer for design or performance.",
        "As recommended in [Document and website structure - Learn web development](https://developer.mozilla.org/en-US/docs/Learn/HTML/Introduction_to_HTML/Document_and_website_structure), I adopted a simple yet effective layout as a starting point for designing my website. It has the advantage of being familiar to people that rely on assistive technologies, and even though I thought it would limit my options, it ended up being a nice frame for the elements I finally chose for my design.",
        "I used semantically meaningful HTML tags when possible, and made all other elements compliant with [Accessible Rich Internet Applications (WAI-ARIA) 1.1](https://www.w3.org/TR/wai-aria-1.1/) following the [WAI-ARIA Authoring Practices 1.1](https://www.w3.org/TR/wai-aria-practices-1.1/). Of course being this my first attempt at a fully accessible design, I’m not expecting it to be perfect, but I will iterate on it over and over until my experience and knowledge becomes sufficient to make it as close to perfect as I possibly can.",
        "This is some of the stuff I implemented in pursuit of the goal of making this site accessible:",
        "Text color was chosen following the [WCAG 2.0 Contrast (Minimum) criteria](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html), mostly using Google Chrome development tools.",
        "I had to give up on the original idea I had for the navigation menu. I had thought of a vertical menu that would expand and collapse according to the navigation’s path and hash, but ultimately this wasn’t going to work as long as I intended to follow the [design patterns oh the WAI-ARIA Authoring Practices 1.1](https://www.w3.org/TR/wai-aria-practices-1.1/#aria_ex). Particularly because the [Menu or Menu bar](https://www.w3.org/TR/wai-aria-practices-1.1/#menu) section says that when Enter key is pressed the menuitem should close it’s menu. As a result I accepted that the navigation menu will be collapsed, except when it’s being used.",
        "For the contact form I followed the [Forms Concepts • Forms • WAI Web Accessibility Tutorials](https://www.w3.org/WAI/tutorials/forms/). As a result I ended up implementing several features within these concepts: labeling controls, form instructions, validating inputs and user notifications.",
        "Labeling controls was done by trying to mantaint the visual and aesthetic features as long as they didn’t hurt accessibility. One example of this is the asterisk commonly used to indicate that a field is required. A screen reader telling you \"Email asterisk, input field...\" would not be a good user experience, so I decided it would be there but had to be ignored by assistive technologies.",
        "Form instructions were a two part job. On one hand we have the field instructions (e.g. name, type, required), and on the other hand we have the instructions prior to entering the form itself. The first thing the user encounters is the information about how many fields there are, and also that all of them are required, a simple paragraph achieved this. Then when the user reaches the first field, it has the necessary information in order to know what to do with it. Other than that, the fields are a simple combination of an HTML label and input tags, with some CSS on top.",
        "Validation and user notifications turned up to be so related with each other that I will cover them together. At first I was validating on input change, but I learned that this is not really accessible. One of the recommendations is to alert users when there is something wrong with their input, now imagine an alert telling the user that an email field is invalid for every character they type until the format is correct, that is really annoying. So even though it is not uncommon to see this kind of feedback on forms around the web, I chose to validate on submit. This way users won’t be interrupted while they type, and it has the benefit of playing nicely with other features recommended for accessibility reasons. These are: first, when something goes wrong an alert tells the user what it was, and second,  the focus is put on the first element with an error. In my case, I decided to alert only about the first error and letting the user know that the focus was placed in that input. I figured that learning about an error and being seamlessly led to the place to fix it, would end up being a more straightforward experience than having to pay attention to all errors and trying to remember what was wrong with each one. Finally I needed a way of letting the user know the result of the send operation. For this I used what’s called a [polite live region](https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Live_Regions) in order to notify the user without annoyances. On a personal note, I chose to add a message to inform users that may be bothered by a banner in front of the content, of the possibility of pressing Escape key to dismiss such banner (there is a more conventional close button which is also announced)."
      ],
      "banner": {
        "src": "assets/img/article-banners/undraw_web_browsing_p77h.svg",
        "alt": "accessibility decorative ilustration"
      }
    },
    "design": {
      "title": "Design",
      "paragraphs": [
        "I'm a software developer and I love design, to the point that I cannot conceive one without the other, in the same way that you could not conceive physical design without the material that makes it possible. Even though I cannot call myself a designer (I have too much respect for design to do so), I love to make my attempts on designing stuff, or at least implement design guidelines that I'm fond of. It’s because of that, that I decided to design my own website.",
        "My intention was to create a website that checked these items in this order: 1) has to be accessible, 2) has to put the content front and center, moving non-essential elements out of the way and hiding the complexity, 3) has to be simple to navigate, and finally, 4) has to be aesthetically pleasing.",
        "I started by carefully choosing the layout, since I understand it is a basic part of the design, and that this decision will, later on, either facilitate my job, or make it harder than it should be. I decided to have three elements to handle three functionalities, three elements to compete for the users attention, three elements to worry about.",
        "First the content, it’s presence takes the whole canvas by being a centered vertical strip floating in a background with no interruptions. This is also a simple recourse to support mobile and desktop screens. And yes, I prefer to design desktop-first, I'm crazy like that 🤪.",
        "Then we have the navigation menu that sits in a corner with minimal presence, some color to indicate active status along with a border for [accessibility reasons](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-without-color.html), and a behavior that allows it to be collapsed onto it’s top level elements (not my original idea, but one that pays off).",
        "And third, there’s a contact and information footer that overlays on top of the content, while fuses with the background. That was my way of saying “This is me, feel free to reach out”, without hiding the message while keeping it out of the way of the content.",
        "A big part of the UI of this site are the amazing illustrations used to accompany these words, and I would like to thank [unDraw](https://undraw.co/) for making all that open source content available to everyone.",
        "I will mention that the design is fully responsive, but I won’t get into details because, honestly, that should be taken for granted nowadays.",
        "Finally, and to be clear, I am not trying to sell you this design, I’m just being explicit about intention and decision making, so you can know I didn’t just take someone else’s design, and to have a guide for myself for future interventions."
      ],
      "banner": {
        "src": "assets/img/article-banners/undraw_art_museum_8or4.svg",
        "alt": "design decorative ilustration"
      }
    },
    "performance": {
      "title": "Performance",
      "paragraphs": [
        "Currently this site doesn't do much to improve performance, it mostly implements passive methods like avoiding heavy assets and unnecessary libraries.",
        "To improve loading times I’m using code splitting by routes, this way the site will only load the content of the selected view, along with the navigation and footer, helping the load performance and making the site feel faster.",
        "Testing with [Lighthouse](https://developers.google.com/web/tools/lighthouse) this site reaches 97/100 on performance which is enough for most apps, and I consider it to be more than enough for a site like this. I will attempt to reach 100/100, which I know is overkill, but since I’m not spending someone’s money, and don’t even have a deadline, there’s no reason no to do it.",
        "I have a sort of roadmap to continue the work on this subject that includes: using a service worker to cache all assets so they will be requested as little as possible, (other superpowers enabled by service workers, like making an installable app or receiving notifications, have no use case in this site so they won’t be used), optimization of images taking advantage of [Squoosh.app](https://squoosh.app/), while also providing different image sizes for different screen sizes, and maybe, transition to server-side rendering."
      ],
      "banner": {
        "src": "assets/img/article-banners/undraw_working_out_6psf.svg",
        "alt": "performance decorative ilustration"
      }
    },
    "tech": {
      "title": "Tech",
      "paragraphs": [
        "Although tech was not the last thing I thought about, it is the last one to be mentioned because it should be out of the way.",
        "That said, these are the more relevant technologies involved with this site:",
        "[HTML5](https://en.wikipedia.org/wiki/HTML5), page structuring and articulation of the other technologies involved.",
        "[JavaScript](https://en.wikipedia.org/wiki/JavaScript), primarily used to build the user interface in the client side, also makes possible the interaction of the users with the page.",
        "[CSS](https://en.wikipedia.org/wiki/Cascading_Style_Sheets), defines and applies the styles and animations that enrich the interaction of users with the site.",
        "[React](https://facebook.github.io/react/), JavaScript library used to build the user interface.",
        "[Redux](https://redux.js.org/), JavaScript library used to handle language state and general app info.",
        "[Webpack](https://webpack.js.org/), bundling and minification of JavaScript as well as other resources to optimize the resources loading.",
        "[TypeScript](https://www.typescriptlang.org/), type checking and transpiling of JavaScript code."
      ],
      "banner": {
        "src": "assets/img/article-banners/undraw_static_assets_rpm6.svg",
        "alt": "tech decorative ilustration"
      }
    }
  }
}